Revit 2026 API

# RepeaterBoundsIsCyclical Method

---

True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCyclical(
	int dimension
)
```
```vb
Public Function IsCyclical (
	dimension As Integer
) As Boolean
```
```cpp
public:
bool IsCyclical(
	int dimension
)
```
```fsharp
member IsCyclical :
        dimension : int -> bool
```

#### Parameters

dimension Int32
     The dimension.

#### Return Value

Boolean True if the bounds are cyclical in the given dimension.

| Exception | Condition |
| --- | --- |
| ArgumentException | The dimension is invalid for these bounds. |
| InvalidOperationException | The bounds must have at least one dimension. |

The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1]. This method does not apply to zero dimensional bounds.

#### Reference

RepeaterBounds Class

Autodesk.Revit.DB Namespace